       01 IO-PARAMETERS.
          05 IO-FUNCTION              PIC X(8).
          05 IO-FORMAT                PIC X(24).
          05 IO-VIEW                  PIC X(24).
          05 IO-KEY                   PIC X(12).
          05 IO-STATUS                PIC X(8).
