IDENTIFICATION DIVISION.
PROGRAM-ID. BARGEND.
DATA DIVISION.
LINKAGE SECTION.
01 LK-ONLY PIC 9(4).
PROCEDURE DIVISION USING LK-ONLY.
MAIN-ENTRY.
    ADD 1 TO LK-ONLY.
    GOBACK.
