IDENTIFICATION DIVISION.
PROGRAM-ID. BARGCALL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-FIRST PIC 9(4).
01 WS-SECOND PIC 9(4).
PROCEDURE DIVISION.
MAIN-ENTRY.
    CALL 'BARGEND' USING WS-FIRST WS-SECOND.
    GOBACK.
