IDENTIFICATION DIVISION.
PROGRAM-ID. BCONTENT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STATUS PIC S9(4) COMP.
PROCEDURE DIVISION.
MAIN-ENTRY.
    MOVE ZERO TO WS-STATUS.
    CALL 'BCONTEND' USING BY CONTENT WS-STATUS.
    IF WS-STATUS NOT = ZERO
        DISPLAY 'THIS-IS-NOT-RETURNED-STATUS'
    END-IF.
    GOBACK.
