IDENTIFICATION DIVISION.
PROGRAM-ID. BRECURS IS RECURSIVE.
DATA DIVISION.
LINKAGE SECTION.
01 LK-DEPTH PIC 9(4).
PROCEDURE DIVISION USING LK-DEPTH.
MAIN-ENTRY.
    IF LK-DEPTH > ZERO
        SUBTRACT 1 FROM LK-DEPTH
        CALL 'BRECURS' USING LK-DEPTH
    END-IF.
    GOBACK.
