IDENTIFICATION DIVISION.
PROGRAM-ID. BREPL.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY BDLAYOUT REPLACING ==OLD-VALUE== BY ==NEW-VALUE==.
PROCEDURE DIVISION.
MAIN-ENTRY.
    CALL 'BARGEND' USING NEW-VALUE.
    GOBACK.
