IDENTIFICATION DIVISION.
PROGRAM-ID. BSUBCALL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-INDEX PIC 9 COMP.
01 WS-TABLE.
   05 WS-VALUE PIC 9(4) OCCURS 4 TIMES.
PROCEDURE DIVISION.
MAIN-ENTRY.
    MOVE 1 TO WS-INDEX.
    CALL 'BARGEND' USING WS-VALUE(WS-INDEX).
    GOBACK.
