       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. COPYROOT.
DATA DIVISION.
LINKAGE SECTION.
01 ROOT-CONTENT-STATUS PIC 9(4) COMP-5.
01 ROOT-VALUE-STATUS PIC 9(4) COMP-5.
PROCEDURE DIVISION USING ROOT-CONTENT-STATUS ROOT-VALUE-STATUS.
MAIN-ENTRY.
    CALL 'MIDCONTENT' USING BY REFERENCE ROOT-CONTENT-STATUS
        ON EXCEPTION
            MOVE 90 TO ROOT-CONTENT-STATUS
    END-CALL.
    CALL 'MIDVALUE' USING BY REFERENCE ROOT-VALUE-STATUS
        ON EXCEPTION
            MOVE 90 TO ROOT-VALUE-STATUS
    END-CALL.
    GOBACK.
