       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. LEAFVALUE.
DATA DIVISION.
LINKAGE SECTION.
01 LEAF-VALUE-STATUS PIC 9(4) COMP-5.
PROCEDURE DIVISION USING BY VALUE LEAF-VALUE-STATUS.
CHANGE-LOCAL-VALUE.
    MOVE 21 TO LEAF-VALUE-STATUS.
    GOBACK.
