       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. LEAFCONTENT.
DATA DIVISION.
LINKAGE SECTION.
01 LEAF-CONTENT-STATUS PIC 9(4) COMP-5.
PROCEDURE DIVISION USING LEAF-CONTENT-STATUS.
CHANGE-LOCAL-COPY.
    MOVE 21 TO LEAF-CONTENT-STATUS.
    GOBACK.
