       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MIDCONTENT.
DATA DIVISION.
LINKAGE SECTION.
01 MIDDLE-CONTENT-STATUS PIC 9(4) COMP-5.
PROCEDURE DIVISION USING MIDDLE-CONTENT-STATUS.
CONTENT-STEP.
    CALL 'LEAFCONTENT' USING BY CONTENT MIDDLE-CONTENT-STATUS
        ON EXCEPTION
            MOVE 91 TO MIDDLE-CONTENT-STATUS
    END-CALL.
    GOBACK.
