       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MIDVALUE.
DATA DIVISION.
LINKAGE SECTION.
01 MIDDLE-VALUE-STATUS PIC 9(4) COMP-5.
PROCEDURE DIVISION USING MIDDLE-VALUE-STATUS.
VALUE-STEP.
    CALL 'LEAFVALUE' USING BY VALUE MIDDLE-VALUE-STATUS
        ON EXCEPTION
            MOVE 91 TO MIDDLE-VALUE-STATUS
    END-CALL.
    GOBACK.
