     A          R ACCTREC                   PFILE(ACCOUNTPF)
     A            ACCTKEY
     A            ACCTBAL
     A            ACCTSTAT
     A          K ACCTKEY
