01 ACCESS-AREA.
    05 ACCESS-FUNCTION PIC X(10).
    05 ACCESS-STATUS PIC X(4).
    05 REQUEST-ID PIC X(8).
    05 REQUEST-TYPE PIC X(8).
    05 REQUEST-STATE PIC X(8).
    05 TARGET-STATE PIC X(8).
