CONTROL-ENTRY.
    PERFORM 1000-INITIALISE.
    PERFORM 2000-GET.
    IF ACCESS-STATUS = 'OK'
        PERFORM 2500-VALIDATE
        IF RECORD-DECISION = 'WORK'
            PERFORM 3000-SAVE
        END-IF
    ELSE
        MOVE 'IOER' TO SCREEN-STATUS ERROR-CAUSE
    END-IF.
    PERFORM 5000-CLOSE.
    PERFORM 4000-NEXT-SCREEN.
    GOBACK.
