       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. EXLEAF.
DATA DIVISION.
LINKAGE SECTION.
01 LEAF-INPUT PIC 9(5)V99.
01 LEAF-OUTPUT PIC 9(5)V99.
01 LEAF-CODE PIC 99.
PROCEDURE DIVISION USING LEAF-INPUT LEAF-OUTPUT LEAF-CODE.
CHECK-AND-COPY.
    MOVE ZERO TO LEAF-OUTPUT LEAF-CODE.
    IF LEAF-INPUT = ZERO
        MOVE 21 TO LEAF-CODE
        MOVE ZERO TO LEAF-OUTPUT
    ELSE
        MOVE LEAF-INPUT TO LEAF-OUTPUT
    END-IF.
    GOBACK.
