000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. INPUTCHK.
000300 DATA DIVISION.
000400 LINKAGE SECTION.
000500 01 CHECK-AMOUNT PIC 9(7)V99.
000600 01 CHECK-COUNT PIC 9(4) COMP-5.
000700 01 CHECK-STATUS PIC 99.
000800 PROCEDURE DIVISION USING BY REFERENCE CHECK-AMOUNT
000900     BY VALUE CHECK-COUNT BY REFERENCE CHECK-STATUS.
001000 CHECK-INPUT.
001100     MOVE ZERO TO CHECK-STATUS.
001200     EVALUATE TRUE
001300         WHEN CHECK-AMOUNT = ZERO
001400             MOVE 21 TO CHECK-STATUS
001500         WHEN CHECK-COUNT < 1 OR CHECK-COUNT > 12
001600             MOVE 22 TO CHECK-STATUS
001700         WHEN OTHER
001800             CONTINUE
001900     END-EVALUATE.
002000     GOBACK.
