       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. ALIASWORK.
DATA DIVISION.
LINKAGE SECTION.
01 FIRST-AMOUNT PIC 9(5)V99.
01 SECOND-AMOUNT PIC 9(5)V99.
PROCEDURE DIVISION USING FIRST-AMOUNT SECOND-AMOUNT.
ALIAS-WORKER.
    MOVE 10 TO FIRST-AMOUNT.
    MOVE 20 TO SECOND-AMOUNT.
    GOBACK.
