       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CONTEXTDYN.
DATA DIVISION.
LINKAGE SECTION.
01 PROGRAM-CHOICE PIC X(10).
01 DYNAMIC-AMOUNT PIC 9(5)V99.
01 DYNAMIC-OUTPUT PIC 9(5)V99.
PROCEDURE DIVISION USING PROGRAM-CHOICE
    DYNAMIC-AMOUNT DYNAMIC-OUTPUT.
DYNAMIC-ENTRY.
    CALL PROGRAM-CHOICE USING DYNAMIC-AMOUNT DYNAMIC-OUTPUT
        ON EXCEPTION
            MOVE ZERO TO DYNAMIC-OUTPUT
    END-CALL.
    GOBACK.
