       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. CONTEXTREC.
DATA DIVISION.
LINKAGE SECTION.
01 RECURSION-DEPTH PIC 9(4) COMP-5.
PROCEDURE DIVISION USING RECURSION-DEPTH.
RECURSIVE-ENTRY.
    IF RECURSION-DEPTH > ZERO
        SUBTRACT 1 FROM RECURSION-DEPTH
        CALL 'CONTEXTREC' USING RECURSION-DEPTH
            ON EXCEPTION
                MOVE ZERO TO RECURSION-DEPTH
        END-CALL
    END-IF.
    GOBACK.
