       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. LOOPCALL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-INDEX PIC 9(4) COMP-5.
01 LOOP-INPUT PIC 9(5)V99.
01 LOOP-OUTPUT PIC 9(5)V99.
PROCEDURE DIVISION.
LOOP-ENTRY.
    PERFORM VARYING LOOP-INDEX FROM 1 BY 1
        UNTIL LOOP-INDEX > 3
        CALL 'ALIASWORK' USING BY REFERENCE LOOP-INPUT LOOP-OUTPUT
            ON EXCEPTION
                MOVE ZERO TO LOOP-OUTPUT
        END-CALL
    END-PERFORM.
    GOBACK.
