01 REQUEST-AREA.
   05 INPUT-PRODUCT PIC X(8).
   05 INPUT-MODE PIC X.
   05 INPUT-STATUS PIC X.
   05 INPUT-DATE PIC 9(8).
   05 INPUT-SUM PIC 9(9)V99.
   05 INPUT-LOAD-PERCENT PIC 9(3)V99.
   05 INPUT-DISCOUNT-PERCENT PIC 9(3)V99.
   05 INPUT-DISCOUNT-LIMIT PIC 9(9)V99.
   05 INPUT-ITEM-COUNT PIC 9(2) COMP.
   05 INPUT-ITEM-1-STATUS PIC X.
   05 INPUT-ITEM-1-AMOUNT PIC 9(7)V99.
   05 INPUT-ITEM-2-STATUS PIC X.
   05 INPUT-ITEM-2-AMOUNT PIC 9(7)V99.
   05 INPUT-ITEM-3-STATUS PIC X.
   05 INPUT-ITEM-3-AMOUNT PIC 9(7)V99.
   05 INPUT-ITEM-4-STATUS PIC X.
   05 INPUT-ITEM-4-AMOUNT PIC 9(7)V99.
   05 INPUT-ITEM-5-STATUS PIC X.
   05 INPUT-ITEM-5-AMOUNT PIC 9(7)V99.
   05 INPUT-ITEM-6-STATUS PIC X.
   05 INPUT-ITEM-6-AMOUNT PIC 9(7)V99.
