       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. EXDYNAMIC.
DATA DIVISION.
LINKAGE SECTION.
01 PROGRAM-CHOICE PIC X(12).
01 DYNAMIC-INPUT PIC 9(5)V99.
01 DYNAMIC-OUTPUT PIC 9(5)V99.
01 DYNAMIC-STATUS PIC 99.
PROCEDURE DIVISION USING PROGRAM-CHOICE DYNAMIC-INPUT
    DYNAMIC-OUTPUT DYNAMIC-STATUS.
DYNAMIC-ENTRY.
    CALL PROGRAM-CHOICE USING BY CONTENT DYNAMIC-INPUT
        BY REFERENCE DYNAMIC-OUTPUT DYNAMIC-STATUS
        ON EXCEPTION
            MOVE 91 TO DYNAMIC-STATUS
            MOVE ZERO TO DYNAMIC-OUTPUT
    END-CALL.
    GOBACK.
