       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. EXLOOP.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-INDEX PIC 9(4) COMP-5.
LINKAGE SECTION.
01 LOOP-INPUT PIC 9(5)V99.
01 LOOP-OUTPUT PIC 9(5)V99.
01 LOOP-STATUS PIC 99.
PROCEDURE DIVISION USING LOOP-INPUT LOOP-OUTPUT LOOP-STATUS.
LOOP-ENTRY.
    MOVE ZERO TO LOOP-OUTPUT LOOP-STATUS.
    PERFORM VARYING LOOP-INDEX FROM 1 BY 1
        UNTIL LOOP-INDEX > 3
        COMPUTE LOOP-OUTPUT = LOOP-OUTPUT + LOOP-INPUT
            ON SIZE ERROR
                MOVE 24 TO LOOP-STATUS
                MOVE ZERO TO LOOP-OUTPUT
        END-COMPUTE
    END-PERFORM.
    GOBACK.
