       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. EXUNKNOWN.
DATA DIVISION.
LINKAGE SECTION.
01 UNKNOWN-OUTPUT PIC 9(5)V99.
01 UNKNOWN-STATUS PIC 99.
PROCEDURE DIVISION USING UNKNOWN-OUTPUT UNKNOWN-STATUS.
UNKNOWN-ENTRY.
    MOVE 24 TO UNKNOWN-STATUS.
    MOVE ZERO TO UNKNOWN-OUTPUT.
    ACCEPT UNKNOWN-OUTPUT.
    GOBACK.
