01 ACCESS-AREA.
    05 ACCESS-FUNCTION PIC X(5).
    05 ACCESS-STATUS PIC X(4).
    05 REQUEST-ID PIC X(12).
    05 REQUEST-STATE PIC X(8).
    05 TARGET-STATE PIC X(8).
