CONTROL-ENTRY.
    PERFORM 1000-INITIALISE.
    PERFORM 2000-PRIMARY-READ.
    IF ACCESS-STATUS = 'OK'
        PERFORM 2500-VALIDATE
        IF RECORD-DECISION = 'OK'
            PERFORM 3000-UPDATE
        END-IF
    ELSE
        IF ACCESS-STATUS NOT = 'END'
            MOVE 'IOER' TO JOB-STATUS
        END-IF
    END-IF.
    PERFORM 4000-CLOSE.
    GOBACK.
