CONTROL-ENTRY.
    PERFORM 1000-INITIALISE.
    PERFORM 2000-FETCH-REQUEST.
    IF ACCESS-STATUS = 'OK'
        PERFORM 2500-VALIDATE
        IF RECORD-DECISION = 'OK'
            PERFORM 3000-SAVE
        END-IF
    ELSE
        MOVE 'IOER' TO SCREEN-STATUS
    END-IF.
    PERFORM 4000-NEXT-SCREEN.
    GOBACK.
